flatPlate-test-koSST/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    top
    {
        type            patch;
        nFaces          200;
        startFace       79600;
    }
    inlet
    {
        type            patch;
        nFaces          200;
        startFace       79800;
    }
    outlet
    {
        type            patch;
        nFaces          200;
        startFace       80000;
    }
    plate
    {
        type            wall;
        inGroups        1(wall);
        nFaces          200;
        startFace       80200;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          80000;
        startFace       80400;
    }
)

// ************************************************************************* //
