flatPlate-test-koSST/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 1.8e-4;

boundaryField
{
    inlet
    {
        type           fixedValue;
        value          uniform 1.8e-4;
    }

    "outlet|top"
    {
        type            zeroGradient;
    }

    plate  
    {
        type           nutLowReWallFunction;
        value          uniform 0;
    }

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
